app/Controllers/TicketController.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $statusFilter = $this->request->getGet('status_filter');
        $perPage = 10; // Jumlah data per halaman

        // Memulai query builder
        $query = $this->ticketModel;

        // Menerapkan kondisi pencarian jika ada
        if ($search) {
            $query = $query->like('code_ticket', $search)
                ->orLike('nama_customer_ticket', $search)
                ->orLike('keluhan', $search)
                ->orLike('nama_petugas_ticket', $search);
        }

        // Menerapkan kondisi filter status jika ada dan bukan 'all'
        if ($statusFilter && $statusFilter !== 'all') {
            $query = $query->where('status', $statusFilter);
        }

        // Mengambil data dengan pagination
        $tickets = $query->paginate($perPage);
---
SELECT *
FROM `tickets`

    public function create()
    {
        $customers = $this->customerModel->findAll();
        $petugas = $this->petugasModel->findAll();
---
SELECT *
FROM `customer`
SELECT *
FROM `petugas`